Revit 2027 API
ParameterTypeId.CurveIsReferenceLine Property
 "Is Reference Line"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveIsReferenceLine { get; }
Public Shared ReadOnly Property CurveIsReferenceLine As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveIsReferenceLine {
	ForgeTypeId^ get ();
}
static member CurveIsReferenceLine : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace